In [ ]:
with t5 as (
select name, occupation,
    row_number() over(partition by occupation order by name) row_id
    from occupations),
t1 as (
    select name, row_id
    from t5
    where t5.occupation = 'Doctor'),
t2 as (
    select name, row_id
    from t5
    where t5.occupation = 'Professor'),
t3 as (
    select name, row_id
    from t5
    where t5.occupation = 'Singer'),
t4 as (
    select name, row_id
    from t5
    where t5.occupation = 'Actor')

select coalesce(t1.name, 'NULL'), coalesce(t2.name, 'NULL'), coalesce(t3.name, 'NULL'), coalesce(t4.name, 'NULL')
from t1 
full outer join t2 on t1.row_id = t2.row_id
full outer join t3 on t3.row_id = t2.row_id
full outer join t4 on t4.row_id = t3.row_id;

Pivot the Occupation column in OCCUPATIONS so that each Name is sorted alphabetically and displayed underneath its corresponding Occupation. The output column headers should be Doctor, Professor, Singer, and Actor, respectively.

Note: Print NULL when there are no more names corresponding to an occupation.

Input Format

The OCCUPATIONS table is described as follows:



Occupation will only contain one of the following values: Doctor, Professor, Singer or Actor.

Sample Input



Sample Output

Jenny    Ashley     Meera  Jane
Samantha Christeen  Priya  Julia
NULL     Ketty      NULL   Maria
Explanation

The first column is an alphabetically ordered list of Doctor names.
The second column is an alphabetically ordered list of Professor names.
The third column is an alphabetically ordered list of Singer names.
The fourth column is an alphabetically ordered list of Actor names.
The empty cell data for columns with less than the maximum number of names per occupation (in this case, the Professor and Actor columns) are filled with NULL values.

In [ ]:
with professions as (
    select
    case when occupation='Doctor' then name end doctor,
    case when occupation='Professor' then name end professor,
    case when occupation='Singer' then name end singer,
    case when occupation='Actor' then name end actor,
    row_number() over(partition by occupation order by name) row_id 
    from occupations
)
select coalesce(min(doctor), 'NULL'), coalesce(min(professor), 'NULL'), coalesce(min(singer), 'NULL'), coalesce(min(actor), 'NULL') 
from professions p
group by row_id;